def area(a, b, c):
    """
    Функция вычисляет полупериметр треугольника
    
    a - Длина первой стороны треугольника
    b - Длина второй стороны треугольника
    c - Длина третьей стороны треугольника
    Возвращаем Полупериметр треугольника, вычисленный по формуле (a + b + c) / 2
    
    """
    return (a + b + c) / 2
    # Вычисляем и возвращаем полупериметр треугольника по формуле (a + b + c) / 2, где a, b и c — длины сторон треугольника

def perimeter(a, b, c):
    """
    Функция вычисляет периметр треугольника
    
    a - Длина первой стороны треугольника
    b - Длина второй стороны треугольника
    c - Длина третьей стороны треугольника
    Возвращает Периметр треугольника, вычисленный по формуле a + b + c
    
    """
    return a + b + c
    # Вычисляем и возвращаем периметр треугольника по формуле a + b + c, где a, b и c — длины сторон треугольника
